tests/Mock/PurchaseResponseCancelled.txt

HTTP/1.1 201 Created
Cache-Control: private,no-store,no-cache,must-revalidate,proxy-revalidate
Pragma: no-cache
Content-Length: 108
Content-Type: application/json; charset=utf-8
Set-Cookie: ASP.NET_SessionId=5g35ug3awdd5pifyctnrveol; path=/; secure; HttpOnly
Access-Control-Allow-Origin: *
Access-Control-Allow-Headers: Content-Type
Access-Control-Allow-Methods: GET, POST, OPTIONS
Access-Control-Max-Age: 1728000
Date: Thu, 23 Oct 2014 2:10:06 GMT

{
  "payments": {
    "id": "PM123",
    "created_at": "2014-05-08T17:01:06.000Z",
    "charge_date": "2014-05-21",
    "amount": 100,
    "description": null,
    "currency": "GBP",
    "status": "cancelled",
    "reference": "WINEBOX001",
    "metadata": {
      "order_dispatch_date": "2014-05-22"
    },
    "amount_refunded": 0,
    "fx": {
      "fx_currency": "EUR",
      "fx_amount": null,
      "exchange_rate": null,
      "estimated_exchange_rate": "1.1234567890"
    },
    "links": {
      "creditor": "CR123"
    },
    "retry_if_possible": false
  }
}
